Repository: grupocorredoira/alertroadupdater_ios_v2
Catalog: alertroadupdater/*.lproj/Localizable.strings
Languages: es, pt_pt

# next_button
source: Next
es: Siguiente
pt_pt: Seguinte

# no_internet_title
source: No Internet Connection
es: No hay conexión a Internet
pt_pt: Sem ligação à Internet

# accept_button
source: Accept
es: Aceptar
pt_pt: Aceitar

source: unknown
es: desconocido
pt_pt: desconhecido

# cancel_button
source: Cancel
es: Cancelar
pt_pt: Cancelar

# terms_title
source: Terms and Conditions
es: Términos y Condiciones
pt_pt: Termos e Condições

# terms_content
source: These terms regulate the use of the Alert Road Updater application. By using the application, you agree to comply with these conditions. 1. Use of the application • The application requires registration of a valid phone number for authentication. • Use of the application is exclusively for adults. 2. Trial period and licenses • The application is free for an initial trial period of one year from the registration date. • At the end of the trial period, the user must acquire a license to continue using the application. 3. Personal data • We collect and process data such as phone number, registration and purchase dates to authenticate the user and manage licenses. • This data is essential for the operation of the application and cannot be deleted while an active contractual relationship exists. 4. Notifications • Alert Road Updater will send notifications only to force critical application updates. 5. User responsibilities • The user is responsible for providing truthful information during registration. • Use of the application for illegal purposes or that violate the rights of third parties is prohibited. 6. Limitations of liability • We are not responsible for technical failures, data loss or service interruptions caused by third parties or by misuse of the application. • The company does not guarantee the continuous operation of the application. 7. Modifications We reserve the right to modify these terms by notifying users through an in-app notice. 8. Applicable law and jurisdiction These terms are governed by the laws of Spain. Any dispute will be resolved in the competent courts of Lugo. 9. Contact For inquiries about these terms, you can write to us at infoalertroad@gmail.com.
es: Estos términos regulan el uso de la aplicación Alert Road Updater. Al usar la aplicación, aceptas cumplir con estas condiciones. 1. Uso de la aplicación • La aplicación requiere el registro de un número de teléfono válido para autenticación. • El uso de la aplicación está destinado exclusivamente a personas mayores de edad. 2. Periodo de prueba y licencias • La aplicación es gratuita durante un periodo inicial de prueba de un año desde la fecha de registro. • Al finalizar el periodo de prueba, el usuario deberá adquirir una licencia para continuar usando la aplicación. 3. Datos personales • Recopilamos y procesamos datos como el número de teléfono, fechas de registro y compra para autenticar al usuario y gestionar licencias. • Estos datos son esenciales para el funcionamiento de la aplicación y no se pueden eliminar mientras exista una relación contractual activa. 4. Notificaciones • Alert Road Updater enviará notificaciones únicamente para forzar actualizaciones críticas de la aplicación. 5. Responsabilidades del usuario • El usuario es responsable de proporcionar información veraz durante el registro. • Queda prohibido el uso de la aplicación para fines ilegales o que violen los derechos de terceros. 6. Limitaciones de responsabilidad • No somos responsables de fallos técnicos, pérdida de datos o interrupciones en el servicio causadas por terceros o por el mal uso de la aplicación. • La empresa no garantiza el funcionamiento continuo de la aplicación. 7. Modificaciones Nos reservamos el derecho de modificar estos términos notificando a los usuarios mediante un aviso en la aplicación. 8. Legislación aplicable y jurisdicción Estos términos se rigen por las leyes de España. Cualquier disputa se resolverá en los tribunales competentes de Lugo. 9. Contacto Para consultas sobre estos términos, puedes escribirnos a infoalertroad@gmail.com.
pt_pt: Estes termos regulam o uso da aplicação Alert Road Updater. Ao usar a aplicação, concorda em cumprir estas condições. 1. Uso da aplicação • A aplicação requer o registo de um número de telefone válido para autenticação. • O uso da aplicação destina-se exclusivamente a pessoas maiores de idade. 2. Período de teste e licenças • A aplicação é gratuita durante um período inicial de teste de um ano a partir da data de registo. • No final do período de teste, o utilizador deverá adquirir uma licença para continuar a usar a aplicação. 3. Dados pessoais • Recolhemos e processamos dados como o número de telefone, datas de registo e compra para autenticar o utilizador e gerir licenças. • Estes dados são essenciais para o funcionamento da aplicação e não podem ser eliminados enquanto existir uma relação contratual ativa. 4. Notificações • O Alert Road Updater enviará notificações apenas para forçar atualizações críticas da aplicação. 5. Responsabilidades do utilizador • O utilizador é responsável por fornecer informações verdadeiras durante o registo. • É proibido o uso da aplicação para fins ilegais ou que violem os direitos de terceiros. 6. Limitações de responsabilidade • Não somos responsáveis por falhas técnicas, perda de dados ou interrupções no serviço causadas por terceiros ou pelo mau uso da aplicação. • A empresa não garante o funcionamento contínuo da aplicação. 7. Modificações Reservamo-nos o direito de modificar estes termos notificando os utilizadores através de um aviso na aplicação. 8. Legislação aplicável e jurisdição Estes termos regem-se pelas leis de Espanha. Qualquer disputa será resolvida nos tribunais competentes de Lugo. 9. Contacto Para questões sobre estes termos, pode escrever-nos para infoalertroad@gmail.com.

# accept_terms_button
source: Accept Terms
es: Aceptar Términos
pt_pt: Aceitar Termos

# privacy_title
source: Privacy Policy
es: Política de Privacidad
pt_pt: Política de Privacidade

# privacy_content
source: At Alert Road Updater, we are committed to protecting the privacy of our users. This policy explains how we collect, use, and protect your personal information. Data we collect • Mobile phone number: Used for authentication and account linking. • Important dates: Registration date and trial period expiration date. • Unique purchase code: Associated with transactions made for the acquisition of the service. Purpose of processing • User authentication and access to the application. • Registration and validation of use during the one-year trial period. • Management of usage licenses and purchases. • Error logging to improve functionality through Crashlytics. Data retention • Data is stored in Firebase, which complies with high security and protection standards. • We retain data as long as the user uses the application and for one year after the last activity, or as required for legal or contractual purposes. Consent By using the application and registering with their phone number, the user grants their explicit consent for the collection and use of their data according to this policy. User rights You can exercise your rights of access, rectification, and opposition by sending an email to infoalertroad@gmail.com. However, it is not possible to delete the account due to license management policies. Information protection We use Firebase to ensure the security of stored data. We implement technical and organizational security measures to protect personal information against unauthorized access, loss, or damage. Modifications We reserve the right to update this policy at any time. We will notify users of significant changes through an in-app notice. Contact If you have questions about this policy, you can write to us at infoalertroad@gmail.com.
es: En Alert Road Updater, nos comprometemos a proteger la privacidad de nuestros usuarios. Esta política explica cómo recopilamos, usamos y protegemos tu información personal. Datos que recopilamos • Número de teléfono móvil: Usado para la autenticación y vinculación de la cuenta. • Fechas importantes: Fecha de registro y fecha de vencimiento del periodo de prueba. • Código único de compra: Asociado a las transacciones realizadas para la adquisición del servicio. Finalidad del tratamiento • Autenticación del usuario y acceso a la aplicación. • Registro y validación del uso durante el periodo de prueba de un año. • Gestión de licencias de uso y compras. • Registro de errores para mejorar la funcionalidad mediante Crashlytics. Conservación de los datos • Los datos se almacenan en Firebase, que cumple con altos estándares de seguridad y protección. • Conservamos los datos mientras el usuario utilice la aplicación y durante un año después de la última actividad, o hasta que se requiera para fines legales o contractuales. Consentimiento Al utilizar la aplicación y registrarse con su número de teléfono, el usuario otorga su consentimiento explícito para la recopilación y uso de sus datos según esta política. Derechos del usuario Puedes ejercer tus derechos de acceso, rectificación y oposición enviando un correo electrónico a infoalertroad@gmail.com. Sin embargo, no es posible eliminar la cuenta debido a las políticas de gestión de licencias. Protección de la información Usamos Firebase para garantizar la seguridad de los datos almacenados. Implementamos medidas de seguridad técnicas y organizativas para proteger la información personal contra el acceso no autorizado, pérdida o daño. Modificaciones Nos reservamos el derecho de actualizar esta política en cualquier momento. Notificaremos a los usuarios sobre los cambios significativos mediante un aviso dentro de la aplicación. Contacto Si tienes preguntas sobre esta política, puedes escribirnos a infoalertroad@gmail.com.
pt_pt: No Alert Road Updater, comprometemo-nos a proteger a privacidade dos nossos utilizadores. Esta política explica como recolhemos, usamos e protegemos as suas informações pessoais. Dados que recolhemos • Número de telemóvel: Usado para a autenticação e vinculação da conta. • Datas importantes: Data de registo e data de fim do período de teste. • Código único de compra: Associado às transações realizadas para a aquisição do serviço. Finalidade do tratamento • Autenticação do utilizador e acesso à aplicação. • Registo e validação do uso durante o período de teste de um ano. • Gestão de licenças de uso e compras. • Registo de erros para melhorar a funcionalidade através do Crashlytics. Conservação dos dados • Os dados são armazenados no Firebase, que cumpre com elevados padrões de segurança e proteção. • Conservamos os dados enquanto o utilizador usar a aplicação e durante um ano após a última atividade, ou até que seja exigido para fins legais ou contratuais. Consentimento Ao utilizar a aplicação e registar-se com o seu número de telefone, o utilizador concede o seu consentimento explícito para a recolha e uso dos seus dados de acordo com esta política. Direitos do utilizador Pode exercer os seus direitos de acesso, retificação e oposição enviando um e-mail para infoalertroad@gmail.com. No entanto, não é possível eliminar a conta devido às políticas de gestão de licenças. Proteção da informação Usamos o Firebase para garantir a segurança dos dados armazenados. Implementamos medidas de segurança técnicas e organizacionais para proteger a informação pessoal contra o acesso não autorizado, perda ou dano. Modificações Reservamo-nos o direito de atualizar esta política a qualquer momento. Notificaremos os utilizadores sobre as alterações significativas através de um aviso dentro da aplicação. Contacto Se tiver perguntas sobre esta política, pode escrever-nos para infoalertroad@gmail.com.

# accept_privacy_button
source: Accept Privacy Policy
es: Aceptar Política de Privacidad
pt_pt: Aceitar Política de Privacidade

# login_title
source: Access your account
es: Accede a tu cuenta
pt_pt: Aceder à sua conta

# login_instructions
source: If you don't have an account, by entering your mobile phone number, we will send you an SMS to register
es: Si no tienes una cuenta creada, al introducir tu teléfono móvil te enviaremos un SMS para registrarte
pt_pt: Se não tem uma conta criada, ao introduzir o seu telemóvel enviar-lhe-emos um SMS para se registar

# phone_label
source: Phone
es: Teléfono
pt_pt: Telefone

# no_internet_message
source: Check your connection to access
es: Verifica tu conexión para acceder
pt_pt: Verifique a sua ligação para aceder

# login_button
source: Access
es: Acceder
pt_pt: Aceder

source: Checking account…
es: Comprobando cuenta…
pt_pt: A verificar conta…

# sms_waiting
source: If you don't receive the SMS in %1$d:%2$02d minutes
es: Si no recibes el SMS en %1$d:%2$02d minutos
pt_pt: Se não receber o SMS em %1$d:%2$02d minutos

# sms_no_waiting
source: If you don't receive the SMS,
es: Si no recibes el SMS,
pt_pt: Se não receber o SMS,

source: click here
es: pulsa aquí
pt_pt: clique aqui

# toast_wait
source: Please wait until 3 minutes have passed
es: Por favor, espera hasta que hayan pasado 3 minutos
pt_pt: Por favor, espere até terem passado 3 minutos

# phone_placeholder
source: Enter your number
es: Introduce tu número
pt_pt: Introduza o seu número

# sms_code_placeholder
source: SMS Code
es: Código SMS
pt_pt: Código SMS

source: Sending SMS...
es: Enviando SMS...
pt_pt: A enviar SMS...

# network_error
source: Network error, please check your internet connection
es: Error de red, comprueba tu conexión a internet
pt_pt: Erro de rede, verifique a sua ligação à internet

# too_many_requests
source: You have made too many attempts, please try again in 24 hours
es: Has hecho demasiados intentos, inténtalo de nuevo en 24 horas
pt_pt: Fez demasiadas tentativas, tente novamente em 24 horas

# invalid_verification_code
source: The entered code is not valid. Please check the SMS and try again.
es: El código introducido no es válido. Revisa el SMS e inténtalo otra vez.
pt_pt: O código introduzido não é válido. Verifique o SMS e tente novamente.

# invalid_phone_number
source: The phone number is not valid. Please check the format.
es: El número de teléfono no es válido. Revisa el formato.
pt_pt: O número de telefone não é válido. Verifique o formato.

# user_data_missing
source: Error: UID or number not found
es: Error: no se encontró UID o número
pt_pt: Erro: UID ou número não encontrado

# user_creation_error
source: Error creating user: %@
es: Error al crear usuario: %@
pt_pt: Erro ao criar utilizador: %@

# number_must_have_9_digits
source: The number must have 9 digits
es: El número debe tener 9 dígitos
pt_pt: O número deve ter 9 dígitos

# es_mobile_must_have_9_digits
source: The mobile number must have 9 digits
es: El número móvil debe tener 9 dígitos
pt_pt: O número de telemóvel deve ter 9 dígitos

# es_mobile_must_start_with_6_or_7
source: With the prefix +34, the phone number must start with 6 or 7
es: Con el prefijo +34 el teléfono debe comenzar con 6 o 7
pt_pt: Com o prefixo +34, o telemóvel deve começar com 6 ou 7

# number_must_have_at_least_9_digits
source: The number must have at least 9 digits.
es: El número debe tener al menos 9 dígitos.
pt_pt: O número deve ter pelo menos 9 dígitos.

# code_must_have_6_digits
source: The code must have 6 digits
es: El código debe tener 6 dígitos
pt_pt: O código deve ter 6 dígitos

# verification_title
source: Verification
es: Verificación
pt_pt: Verificação

# verification_instructions
source: We will send you an SMS. Then, enter the verification code that appears in the message:
es: Te vamos a enviar un SMS. A continuación, introduce el código de verificación que aparece en el mensaje:
pt_pt: Vamos enviar-lhe um SMS. De seguida, introduza o código de verificação que aparece na mensagem:

# verify_button
source: Verify
es: Verificar
pt_pt: Verificar

# verifying_title
source: Verifying
es: Verificando
pt_pt: A verificar

# verifying_message
source: Verifying the code, do not close the application
es: Verificando el código, no cierres la aplicación
pt_pt: A verificar o código, não feche a aplicação

# clean_button
source: Clear
es: Limpiar
pt_pt: Limpar

# welcome_title
source: Welcome
es: Bienvenido
pt_pt: Bem-vindo

source: Registered phone: %@
es: Teléfono registrado: %@
pt_pt: Telefone registado: %@

# start_button
source: Start
es: Empezar
pt_pt: Começar

# access_required_title
source: Access Required
es: Acceso requerido
pt_pt: Acesso Requerido

# access_required_message
source: The 1-year trial period has ended, you need to purchase the service to continue.
es: Se ha terminado el periodo de prueba de 1 año, necesitas comprar el servicio para continuar.
pt_pt: O período de teste de 1 ano terminou, precisa de comprar o serviço para continuar.

# buy_button
source: Buy
es: Comprar
pt_pt: Comprar

# starting_message
source: Starting…
es: Empezando…
pt_pt: A começar…

# user_error_message
source: Error finding user, please check your internet connection or close and reopen the application
es: Error al buscar el usuario, por favor, revisa tu conexión a internet o cierra y vuelve a abrir la aplicación
pt_pt: Erro ao procurar o utilizador, por favor, verifique a sua ligação à internet ou feche e volte a abrir a aplicação

# auth_error_message
source: Authentication error, please check your internet connection or close and reopen the application
es: Error de autenticación, por favor, revisa tu conexión a internet o cierra y vuelve a abrir la aplicación
pt_pt: Erro de autenticação, por favor, verifique a sua ligação à internet ou feche e volte a abrir a aplicação

# billing_connection_error_message
source: Error connecting to billing service
es: Error al conectar con el servicio de facturación
pt_pt: Erro ao ligar ao serviço de faturação

# notifications_permission_title
source: Notifications Permission
es: Permiso de notificaciones
pt_pt: Permissão de Notificações

# notifications_permission_body
source: This permission is needed to inform you when there are document updates
es: Se necesita este permiso para poder informarte cuando haya actualizaciones de los documentos
pt_pt: É necessária esta permissão para poder informá-lo quando houver atualizações dos documentos

# grant_permission_button
source: Grant Permission
es: Conceder Permiso
pt_pt: Conceder Permissão

# settings_label
source: Settings
es: Ajustes
pt_pt: Definições

source: User Preferences
es: Preferencias de usuario
pt_pt: Preferências de utilizador

# privacy_policy_option
source: Privacy Policy
es: Políticas de Privacidad
pt_pt: Política de Privacidade

# terms_conditions_option
source: Terms and Conditions
es: Términos y Condiciones
pt_pt: Termos e Condições

# delete_files_option
source: Delete Files
es: Borrar archivos
pt_pt: Eliminar ficheiros

# disconnect_option
source: Disconnect
es: Desconectar
pt_pt: Desconectar

# version_code_text
source: Version: %@(%@)
es: Versión: %@(%@)
pt_pt: Versão: %@(%@)

# confirm_disconnect_title
source: Confirm Disconnection
es: Confirmar desconexión
pt_pt: Confirmar desconexão

# confirm_disconnect_message
source: To avoid problems with your account, we advise not logging out. Are you sure you want to log out?
es: Para evitar problemas con tu cuenta, aconsejamos no cerrar tu sesión, ¿estás seguro de que deseas salir de tu cuenta?
pt_pt: Para evitar problemas com a sua conta, aconselhamos não fechar a sua sessão, tem a certeza de que deseja sair da sua conta?

# yes_button
source: Yes
es: Sí
pt_pt: Sim

# no_button
source: No
pt_pt: Não

source: No files in memory
es: No hay archivos en memoria
pt_pt: Não há ficheiros em memória

# files_delete_correctly
source: Files deleted successfully
es: Archivos borrados correctamente
pt_pt: Ficheiros eliminados corretamente

# files_delete_error
source: Error deleting some files: %@
es: Error al borrar algunos archivos: %@
pt_pt: Erro ao eliminar alguns ficheiros: %@

# no_files
source: No files in memory
es: No hay archivos en memoria
pt_pt: Não há ficheiros em memória

# delete_success
source: Files deleted successfully
es: Archivos borrados correctamente
pt_pt: Ficheiros eliminados corretamente

# delete_error
source: Error deleting some files:
es: Error al borrar algunos archivos:
pt_pt: Erro ao eliminar alguns ficheiros:

# disconnect_title
source: Are you sure you want to log out?
es: ¿Seguro que quieres cerrar sesión?
pt_pt: Tem a certeza de que quer terminar sessão?

# disconnect_message
source: To avoid problems with your account, we advise not logging out. Are you sure you want to log out?
es: Para evitar problemas con tu cuenta, aconsejamos no cerrrar sesión, ¿estás seguro que deseas salir de tu cuenta?
pt_pt: Para evitar problemas com a sua conta, aconselhamos não terminar sessão, tem a certeza de que deseja sair da sua conta?

# logout_button
source: Log out
es: Cerrar sesión
pt_pt: Terminar sessão

# delete_no_files
source: No files to delete
es: No hay archivos para eliminar
pt_pt: Não há ficheiros para eliminar

# delete_error_prefix
source: Error deleting files:
es: Error eliminando archivos:
pt_pt: Erro ao eliminar ficheiros:

# error_downloading_files
source: Error downloading some files. Please try again.
es: Error al descargar algunos archivos. Inténtalo de nuevo.
pt_pt: Erro ao descarregar alguns ficheiros. Tente novamente.

# notifications_title
source: Notifications
es: Notificaciones
pt_pt: Notificações

# notifications_description
source: Receive notifications when the speed camera database is updated
es: Recibir notificaciones cuando se actualice la base de datos de radares
pt_pt: Receber notificações quando a base de dados de radares for atualizada

# connection_title
source: Connection
es: Conexión
pt_pt: Ligação

# step_one
source: Step 1: turn on Alert Road device Wi-Fi
es: Paso 1: encender Wi-Fi del dispositivo Alert Road
pt_pt: Passo 1: ligar o Wi-Fi do dispositivo Alert Road

# step_two
source: Step 2: go to Wi-Fi settings to check the networks and indicate which of the following is available (do not connect yet)
es: Paso 2: abre ajustes Wi-Fi, revisa las redes e indica cuál de las siguientes aparece disponible (no te conectes todavía)
pt_pt: Passo 2: abre as definições de Wi-Fi, verifica as redes e indica qual das seguintes aparece disponível (não te ligues ainda)

# step_three
source: Step 3: detect device
es: Paso 3: detectar dispositivo
pt_pt: Passo 3: detetar dispositivo

# help_button
source: See how to do it
es: Ver cómo hacerlo
pt_pt: Ver como fazer

source: Wi-Fi enabled
es: Wi-Fi encendido
pt_pt: Wi-Fi ligado

source: Enable Wi-Fi
es: Encender Wi-Fi
pt_pt: Ligar Wi-Fi

source: Detect device
es: Detectar dispositivo
pt_pt: Detetar dispositivo

source: Device found
es: Dispositivo encontrado
pt_pt: Dispositivo encontrado

# connection_issues
source: Connection issues, retry
es: Problemas de conexión, volver a intentar
pt_pt: Problemas de ligação, tentar novamente

# device_not_found
source: If none of these networks appear, please check step 1
es: Si no aparece ninguna de estas redes, por favor, revisa el paso 1
pt_pt: Se nenhuma destas redes aparecer, por favor, verifique o passo 1

# device_name
source: Device: %@
es: Dispositivo: %@
pt_pt: Dispositivo: %@

source: Wi-Fi Network: %@
es: Red Wi-Fi: %@
pt_pt: Rede Wi-Fi: %@

source: Detecting devices…
es: Detectando dispositivos…
pt_pt: A detetar dispositivos…

# please_wait
source: Please wait %@d seconds
es: Por favor, espera %@d segundos
pt_pt: Por favor, espere %@d segundos

# updating_documents
source: Updating documents… This may take a few minutes, please wait
es: Actualizando documentos… Esto puede tardar unos minutos, mantente a la espera
pt_pt: A atualizar documentos… Isto pode demorar alguns minutos, por favor, aguarde
