Repository: grupocorredoira/alertroadupdater_ios_v2
Catalog: alertroadupdater/*.lproj/Localizable.strings
Languages: es, pt_pt

# permission_location
source: Location access is required to check the connection to the Alert Road device
es: Se requiere acceso a la ubicación para poder comprobar la conexión al dispositivo Alert Road
pt_pt: É necessário acesso à localização para verificar a ligação ao dispositivo Alert Road

# permission_write_settings
source: Access is required to configure the system and perform Wi-Fi actions
es: Se requiere acceso para configurar el sistema y realizar acciones con el Wi-Fi
pt_pt: É necessário acesso para configurar o sistema e realizar ações com o Wi-Fi

# permission_generic
source: A permission is required.
es: Se requiere un permiso.
pt_pt: É necessária uma permissão.

source: Permission Required
es: Permiso requerido
pt_pt: Permissão Necessária

source: Grant Permission
es: Conceder permiso
pt_pt: Conceder Permissão

# documents_title
source: Documents
es: Documentos
pt_pt: Documentos

# step_documents
source: Documents available for device: %@
es: Documentos disponibles para el dispositivo: %@
pt_pt: Documentos disponíveis para o dispositivo: %@

# download_required
source: You need to download a file to continue
es: Necesitas descargar algún archivo para continuar
pt_pt: Precisa de descarregar algum ficheiro para continuar

# error_loading_documents
source: Error loading documents, check your internet connection
es: Error cargando documentos, revisa tu conexión a internet
pt_pt: Erro ao carregar documentos, verifique a sua ligação à internet

# download_button
source: Download
es: Descargar
pt_pt: Descarregar

# downloading_button
source: Downloading %@d%%
es: Descargando %@d%%
pt_pt: A descarregar %@d%%

# document_version
source: Version
es: Versión
pt_pt: Versão

# status_label
source: Status: %@
es: Estado: %@
pt_pt: Estado: %@

# document_status
source: Status: %@
es: Estado: %@
pt_pt: Estado: %@

# document_status_available
source: Available for download
es: Disponible para descargar
pt_pt: Disponível para descarregar

# document_status_downloaded
source: Downloaded
es: Descargado
pt_pt: Descarregado

# document_status_downloading
source: Downloading…
es: Descargando…
pt_pt: A descarregar…

# upload_screen_title
source: Send Files
es: Enviar archivos
pt_pt: Enviar ficheiros

# connect_to_network
source: Connect to Wi-Fi network:
es: Conéctate a la red WiFi:
pt_pt: Ligue-se à rede Wi-Fi:

# connect_to_device
source: Connected to
es: Conectado a
pt_pt: Ligado a

# documents_to_send
source: Documents available to send:
es: Documentos disponibles para enviar:
pt_pt: Documentos disponíveis para enviar:

# upload_success
source: File %@ - version %@ uploaded successfully.
es: Archivo %@ - versión %@ cargado con éxito.
pt_pt: Ficheiro %@ - versão %@ carregado com sucesso.

# upload_error
source: Error uploading file %@ - version %@
es: Error al cargar el archivo %@ - versión %@
pt_pt: Erro ao carregar o ficheiro %@ - versão %@

source: Sending file
es: Enviando archivo
pt_pt: A enviar ficheiro

# progress_completed
source: %1$d%% completed
es: %1$d%% completado
pt_pt: %1$d%% concluído

# dont_close_app
source: Please do not close or minimize the application until the upload is complete.
es: Por favor, no cierres ni minimices la aplicación hasta finalizar el envío.
pt_pt: Por favor, não feche nem minimize a aplicação até finalizar o envio.

# error_dialog_title
source: Error
pt_pt: Erro

# what_to_do
source: What do you want to do?
es: ¿Qué deseas hacer?
pt_pt: O que deseja fazer?

# close_app
source: Close application
es: Cerrar aplicación
pt_pt: Fechar aplicação

source: Go to Home
es: Volver al inicio
pt_pt: Voltar ao início

source: Connected
es: Conectado
pt_pt: Ligado

source: Connect
es: Conectar
pt_pt: Ligar

# finish_button
source: Finish
es: Finalizar
pt_pt: Finalizar

# close_button
source: Close
es: Cerrar
pt_pt: Fechar

# upload_progress
source: Progress: %1$d%%
es: Progreso: %1$d%%
pt_pt: Progresso: %1$d%%

# upload_available
source: Send
es: Enviar
pt_pt: Enviar

# upload_in_progress
source: Sending… %1$d%%
es: Enviando… %1$d%%
pt_pt: A enviar… %1$d%%

# upload_completed
source: Sent
es: Enviado
pt_pt: Enviado

# upload_unknown_status
source: Unknown status
es: Estado desconocido
pt_pt: Estado desconhecido

# unknown_password
source: No password found
es: No se encontró ninguna contraseña
pt_pt: Não foi encontrada nenhuma palavra-passe

source: DONE!
es: ¡HECHO!
pt_pt: CONCLUÍDO!

# copy_password
source: Copy the following password:
es: Copia la siguiente contraseña:
pt_pt: Copie a seguinte palavra-passe:

source: Go to Wi-Fi settings
es: Ir a ajustes Wi-Fi
pt_pt: Ir para definições de Wi-Fi

source: Go to settings
es: Ir a ajustes
pt_pt: Ir para definições

source: Password copied
es: Contraseña copiada
pt_pt: Palavra-passe copiada

# document_success
source: Document %@ with version: %@ uploaded successfully
es: Documento %@ con versión: %@ cargado con éxito
pt_pt: Documento %@ com versão: %@ carregado com sucesso

source: Finish and Close
es: Finalizar y cerrar
pt_pt: Finalizar e fechar

# no_internet_warning
source: Remember you are WITHOUT INTERNET! Disconnect from network %@
es: ¡Recuerda que estás SIN INTERNET! Desconéctate de la red %@
pt_pt: Lembre-se que está SEM INTERNET! Desligue-se da rede %@

# version_text
source: Version: %@
es: Versión: %@
pt_pt: Versão: %@

# socket_error
source: The document could not be sent. Check in Settings > alertroadupdater > Local Network that the option is enabled, then try again later
es: no se ha podido enviar el documento, revisa en Ajustes > alertroadupdater > Red Local que tienes la opción activada y vuelve a intentarlo más tarde
pt_pt: Não foi possível enviar o documento. Verifica em Definições > alertroadupdater > Rede Local se a opção está ativada e tenta novamente mais tarde

# socket_error_timeout
source: An unexpected error occurred, the document could not be sent, please try again later
es: ha ocurrido un error inesperado, no se ha podido enviar el documento, vuelve a intentarlo más tarde
pt_pt: Ocorreu um erro inesperado, não foi possível enviar o documento, tente novamente mais tarde

# download_status_available
source: Available for download
es: Disponible para descargar
pt_pt: Disponível para descarregar

# download_status_downloaded
source: Downloaded
es: Descargado
pt_pt: Descarregado

# download_status_downloading
source: Downloading... %d%%
es: Descargando... %d%%
pt_pt: A descarregar... %d%%
